MESSAGES = {
    'user_start': '👋🏻 Здравствуйте, {}\n\n'
                    '🤖 Добро пожаловать в бота компании Panasonic! \n'
                    '📱 Отправьте свой номер, чтобы пройти аутентификацию!',
    'success_logged': '✅ Вы успешно авторизировались!\n'
                      '👤 Имя: {}\n'
                      '👤 Фамилия: {}\n'
                      '📞 Номер телефона: {}\n\n'
                      'Спасибо, что вошли в систему.\n'
                      'Этот бот создан для удобной отправки отчетов о ваших продажах.\n'
                      'С его помощью вы сможете быстро и просто передавать данные о продажах.',
    'permission_denied': '❌ Нет доступа',
    'send_sales_report': '📂 Пожалуйста, загрузите Excel-файл с отчетом по продажам.\n\n'
                         '❌ Чтобы избежать ошибок, используйте шаблон, приведённый выше.',
    'task_title': '📤 Отправьте поручение ( текст, фотография, файл. Разрешается прикрепление 1 файла) :',
    'lot_title': 'Напишите наименование лота:',
    'lot_project_input': 'Введите название проекта: ',
    'lot_detail': '#️⃣ Лот №{}\n'
                  '💬 Наименование: {}\n'
                  '🔗 Проект: {}\n'
                  '🔄 Статус: {}\n'
                  '👤 Ответственный: Сайдахмедов Ислом Улугбекович\n\n',

    'contract_detail': '#️⃣ Лот №{}\n'
                       '💬 Наименование: {}\n'
                       '🔗 Проект: {}\n'
                       '🏢 Поставщик: {}\n'
                       '💵 Сумма контракта: {}{}\n'
                       '🔄 Статус: {}\n'
                       '👤 Ответственный: Хамидов Тохир Насиржанович\n\n',
    'choose_lot': 'Ищите лот по названию или по ID:',
    'task_created': '✅ Создано поручение №{}\n\n'
                    '👤 Выберите исполнителя поручения из списка или напишите его данные, чтобы совершить поиск:',
    'period_of_execution': '📅 Отправьте срок исполнения задачи в днях.',
    'executor_task': '🔔 Вам было назначено поручение!\n\n'
                     '#️⃣ Поручение №: {id}\n'
                     '👤 От: {creator}\n'
                     '🗒 Задание: {title}\n'
                     '🔄 Статус: {status}\n'
                     '📅 Срок выполнение: {deadline}',
    'completed_task': '🔔 Ваше поручение было выполнено!\n\n'
                      '#️⃣ Поручение №: {id}\n'
                      '👤 Исполнитель: {executor}\n'
                      '🗒 Результат: {result}\n'
                      '📅 Дата поручения: {created}\n'
                      '📅 Дата выполнения: {finish_date}\n'
                      '🔄 Статус: {status}\n',
    'task_sent': '✅ Данные успешно отправлены',
    'complete_task': '✅ Отправьте результат выполнения задачи (можно прикрепить 1 фотографию или 1 файл):',
    'main_step': 'Выберите что вас интересует 👇🏼',
    'choose_category': 'Выберите категорию 👇🏼',
    'input_provider_name': 'Введите наименование поставщика:',
    'input_contract_amount': 'Введите сумму контракта:',
    'choose_currency': 'Выберите валюту:',
    'lot_send_report': '📃 Отправка отчёта по лоту: {}\n\n'
                       '📎 Разрешается прикрепление сообщения в текстовом формате или же'
                       ' документа (pdf, docx, xlslx, jpeg, jpg, png)',
    'lot_sent_report': '✅ Отчёт успешно прикреплен под номером: {}'
}
